<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads latest Visual Studio Code.</string>
		<key>Identifier</key>
		<string>com.github.killahquam.download.visualstudiocode</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Visual Studio Code</string>
			<key>DOWNLOAD_URL</key>
			<string>https://go.microsoft.com/fwlink/?LinkID=2156837</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.2.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>%DOWNLOAD_URL%</string>
					<key>filename</key>
					<string>%NAME%.zip</string>
					<key>request_headers</key>
					<dict>
						<key>user-agent</key>
						<string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10.11; rv:46.0) Gecko/20100101 Firefox/46.0</string>
					</dict>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>Unarchiver</string>
				<key>Arguments</key>
				<dict>
					<key>archive_path</key>
					<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.zip</string>
					<key>purge_destination</key>
					<true />
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
				<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%/Visual Studio Code.app</string>
					<key>requirement</key>
					<string>identifier "com.microsoft.VSCode" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = UBF8T346G9</string>
				</dict>
			</dict>
		</array>
	</dict>
</plist>